Revit 2027 API
UpdaterId Constructor
 creates an instance of UpdaterId for given AddInId and a given GUID value
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public UpdaterId(
	AddInId addInId,
	Guid val
)
Public Sub New (
	addInId As AddInId,
	val As Guid
)
public:
UpdaterId(
	AddInId^ addInId,
	Guid val
)
new :
        addInId : AddInId *
        val : Guid -> UpdaterId
Parameters
addInId AddInId
 Id of addin that registers an Updater
val Guid
 a stable GUID identifying the Updater within addin
Exceptions
Exception | Condition
ArgumentException |  addInId is not valid.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
UpdaterId Class
Autodesk.Revit.DB Namespace